# Работа с файлами

# Основные операции с файлами: чтение(read),добавление(append)/перезапись(write), удаление(delite)


# Алгоритм работы с файлами

'''
1) Открытие файла - получение файлового потока
2) Выполнение основных операций
3) Закрытие файла! - оссвобождение ресурсов операционной системы(идаление из памяти)
'''

# 1) Открытие файла - получение файлового потока
f = open('resume.txt', 'r', encoding='utf-8')
# 2) Выполнение основных операций
print(f.read())
# 3) Закрытие файла! - оссвобождение ресурсов операционной системы(идаление из памяти)
f.close()


# основные операции при работе с файлами

'''
'r' - чтение(по умолчанию). если файл несуществует получаем ошибку
'w' - перезапись. Создается новый файл, если его нет, если он есть, будет перезапись(сотрется все содержимое и останится то что записали)
'a' - добавление в конец, если файла нет то идет запись в конец
'x' - открывает файл только для записи, но если файл существует - выбрасывается ошибка FileExistError
'+' - открытие файла для чтения и записи одновременно
'b' - бинарный режим (при работе с изображениями, видео, аудио)
'''

'''
'rb'
'w+'
'wb
'''

# Контекстный менеджер
with open('resume.txt', 'r', encoding='utf-8') as f:
    content = f.read()
    print(content)

# Контекстный менеджер гарантирует закрытие файла после выполнения
