"""1 Создайте переменную name и присвойте ей ваше имя. Создайте переменную age с вашим возрастом. Выведите фразу "Меня зовут [имя], мне [возраст] лет".

2 Создайте переменные разных типов: целое число, число с плавающей точкой, строку и булево значение. Выведите тип каждой переменной используя type().

3 Преобразуйте строку "123" в целое число, затем в число с плавающей точкой, и затем обратно в строку.

4 Создайте переменную pi со значением 3.14159. Округлите это число до 2 знаков после запятой и сохраните в новую переменную.

5 Попросите пользователя ввести два числа через input(), сложите их и выведите результат. (Не забудьте про преобразование типов)"""

# 1
name = 'Sergei'
age = 30
print('Меня завут:', name)
print('Мой возраст: ',age)

# 2
num_int = 1646
num_float = 36.54
num_str = '541'
num_bool = True
print(type(num_int))
print(type(num_float))
print(type(num_str))
print(type(num_bool))

# 3
num_test = int(num_str)
num_test = float(num_test)
num_test = str(num_test)
print(type(num_test))
print(num_test)

# 4  round() - для матиматического округления (Срезы здесь НЕ подходят)
PI = 3.14159
okrugleno_PI = round(PI, 2)
print(okrugleno_PI)

# 5 Простейший калькулятор который принимает только целые числа (input возврощает строки!)
num_1 = input('Введите первое число:')
num_1 = int(num_1)
num_2 = input('Введите второе число:')
num_2 = int(num_2)
num_sum = num_1 + num_2
print(num_sum)
