# арифметические операции

# операция +
num1 = 10
num2 = 5
num3 = -20
num4 = 7.5
num5 = 2.5

summa1 = num1 + num2
print(summa1)

summa2 = num1 + num3
print(summa2)

# int + int = int
print(2 + 9)
# int + float = float
print(4 + 16.19)
# float + float = float
print(5.5 + 1.5)

# дла строк тоже работает "+" (конкатенация)
name = 'Sergei'
surname = 'Kochkin'
print(name + surname)

# сложение числа со строкой приводит к ошибке
# числа можно складывать с bool

# операция вычитания "-"
print(num1 - num2)
print(num4 - num5)

# унарный минус
print(num1 - -num2) # 10 - -5 = 10 + 5

# для строк нет операции вычитания

# операция умножения "*"
print(num4 * num5) # 18.75
print(num1 * num2) # 50
print(num1 * num3) # -200
print(num1 * 0) # 0
# повторение строк
print(name * 3)

# операция деления "/"
# при делении результат всегда float
print(num1 / num2) # 2.0
print(0 / num2) # 0.0
# print(num1 / 0) # ZeroDivisionError: division by zero
print(2 / 3) # можно получить бесконечную дробь

# Целочисленное деление "//"
#  отбрасывает дробную часть
# если используем float то ответ будет float
print(5 // 2)
print(10 // 3)
print(10 // 2.3)

# Оператор остаток от деления "%"
print(10 % 2)
print(10 % 2.3)
print(10 % 4)

# Проверка чётности числа
# число четное когда остаток от деления равен нулю
print(9 % 2 == 0)
print(10 % 2 == 0)

# Возведение в степень "**"
print(2 ** 2)
print(2 ** 4)
print(2 ** 0) # Любое число в нулевой степени равно 1
print(0 ** 54) # = 0

print(4 ** (1 / 2)) # Квадратный корень
print(4 ** (1/3)) # Кубический корень

print(4 ** -1) # 1/2

# Приоритет операторов
# Порядок выполнения (от высшего к низшему):
# 1. () - скобки
# 2. ** - возведение в степень
# 3. +x, -x - унарные плюс, минус
# 4. *, /, //, % - умножение, деление, целочисленное деление, остаток
# 5. +, - - сложение, вычитание
"""
# Примеры
2 + 3 * 4      # 14 (сначала 3*4=12, затем 2+12)
(2 + 3) * 4    # 20 (сначала 2+3=5, затем 5*4)
2 ** 3 * 4     # 32 (сначала 2³=8, затем 8*4)
2 ** (3 * 4)   # 4096 (сначала 3*4=12, затем 2¹²)
-3 ** 2        # -9 (сначала 3²=9, затем -(9)) <- работает унарный минус
(-3) ** 2      # 9 (квадрат -3)
10 / 2 * 3     # 15.0 (слева направо: 10/2=5, 5*3=15)
"""

